Wafleem/STM32N6-EdgeAI-CV/Middlewares/stm32-mw-camera/cmw_camera.c
 /**
 ******************************************************************************
 * @file    cmw_camera.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "cmw_camera.h"

#include "isp_api.h"
#include "stm32n6xx_hal_dcmipp.h"
#include "cmw_utils.h"
#include "cmw_io.h"
#if defined(USE_VD55G1_SENSOR)
#include "cmw_vd55g1.h"
#endif
#if defined(USE_VD65G4_SENSOR)
#include "cmw_vd65g4.h"
#endif
#if defined(USE_IMX335_SENSOR)
#include "cmw_imx335.h"
#endif
#if defined(USE_OV5640_SENSOR)
#include "cmw_ov5640.h"
#endif
#if defined(USE_VD66GY_SENSOR)
#include "cmw_vd66gy.h"
#endif
#if defined(USE_VD56G3_SENSOR)
#include "cmw_vd56g3.h"
#endif
#if defined(USE_VD1943_SENSOR)
#include "cmw_vd1943.h"
#endif
#if defined (USE_VD5943_SENSOR)
#include "cmw_vd5943.h"
#endif
#if defined(USE_IMX219_SENSOR)
#include "cmw_imx219.h"
#endif
#include "assert.h"

typedef struct
{
  uint32_t Resolution;
  uint32_t pixel_format;
  uint32_t LightMode;
  uint32_t ColorEffect;
  int32_t  Brightness;
  int32_t  Saturation;
  int32_t  Contrast;
  int32_t  HueDegree;
  int32_t  Gain;
  int32_t  Exposure;
  int32_t  ExposureMode;
  uint32_t MirrorFlip;
  uint32_t Zoom;
  uint32_t NightMode;
  uint32_t IsMspCallbacksValid;
  uint32_t TestPattern;
} CAMERA_Ctx_t;

CMW_CameraInit_t  camera_conf;
CMW_Sensor_Name_t connected_sensor;
CAMERA_Ctx_t  Camera_Ctx;

DCMIPP_HandleTypeDef hcamera_dcmipp;
static CMW_Sensor_if_t Camera_Drv;

static union
{
#if defined(USE_IMX335_SENSOR)
  CMW_IMX335_t imx335_bsp;
#endif
#if defined(USE_VD55G1_SENSOR)
  CMW_VD55G1_t vd55g1_bsp;
#endif
#if defined(USE_VD65G4_SENSOR)
  CMW_VD65G4_t vd65g4_bsp;
#endif
#if defined(USE_VD66GY_SENSOR)
  CMW_VD66GY_t vd66gy_bsp;
#endif
#if defined(USE_VD56G3_SENSOR)
  CMW_VD56G3_t vd56g3_bsp;
#endif
#if defined(USE_OV5640_SENSOR)
  CMW_OV5640_t ov5640_bsp;
#endif
#if defined(USE_VD1943_SENSOR)
  CMW_VD1943_t vd1943_bsp;
#endif
#if defined(USE_VD5943_SENSOR)
  CMW_VD5943_t vd5943_bsp;
#endif
#if defined(USE_IMX219_SENSOR)
  CMW_IMX219_t imx219_bsp;
#endif
} camera_bsp;

int is_camera_init = 0;
int is_camera_started = 0;
int is_pipe1_2_shared = 0;

#if defined(USE_IMX335_SENSOR)
static int32_t CMW_CAMERA_IMX335_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_IMX219_SENSOR)
static int32_t CMW_CAMERA_IMX219_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD55G1_SENSOR)
static int32_t CMW_CAMERA_VD55G1_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD65G4_SENSOR)
static int32_t CMW_CAMERA_VD65G4_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_OV5640_SENSOR)
static int32_t CMW_CAMERA_OV5640_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD66GY_SENSOR)
static int32_t CMW_CAMERA_VD66GY_Init(CMW_Sensor_Init_t *initValues);
#endif
#if defined(USE_VD56G3_SENSOR)
static int32_t CMW_CAMERA_VD56G3_Init(CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD1943_SENSOR)
static int32_t CMW_CAMERA_VD1943_Init(CMW_Sensor_Init_t *initValues);
#endif
#if defined(USE_VD5943_SENSOR)
static int32_t CMW_CAMERA_VD5943_Init(CMW_Sensor_Init_t *initValues);
#endif
static void CMW_CAMERA_EnableGPIOs(void);
static void CMW_CAMERA_PwrDown(void);
static int32_t CMW_CAMERA_SetPipe(DCMIPP_HandleTypeDef *hdcmipp, uint32_t pipe, CMW_DCMIPP_Conf_t *p_conf, uint32_t *pitch);
static int CMW_CAMERA_Probe_Sensor(CMW_Sensor_Init_t *initValues, CMW_Sensor_Name_t *sensorName);

static const char *CMW_CAMERA_SensorNameToString(CMW_Sensor_Name_t sensor)
{
  switch (sensor)
  {
    case CMW_VD66GY_Sensor: return "VD66GY";
    case CMW_VD56G3_Sensor: return "VD56G3";
    case CMW_IMX335_Sensor: return "IMX335";
    case CMW_OV5640_Sensor: return "OV5640";
    case CMW_VD55G1_Sensor: return "VD55G1";
    case CMW_VD65G4_Sensor: return "VD65G4";
    case CMW_VD1943_Sensor: return "VD1943";
    case CMW_VD5943_Sensor: return "VD5943";
    case CMW_IMX219_Sensor: return "IMX219";
    case CMW_UNKNOWN_Sensor:
    default: return "UNKNOWN";
  }
}

static void CMW_CAMERA_DumpDcmippPipeState(const char *tag, uint32_t pipe, const uint8_t *pbuff)
{
  printf("TRACE: %s: pipe=%lu buffer=%p align=0x%lX dcmipp_state=%lu pipe_state=%lu err=0x%08lX "
         "cmcr=0x%08lX cmier=0x%08lX cmsr1=0x%08lX cmsr2=0x%08lX\n",
         tag,
         (unsigned long) pipe,
         pbuff,
         (unsigned long) ((uint32_t) pbuff & 0xFUL),
         (unsigned long) HAL_DCMIPP_GetState(&hcamera_dcmipp),
         (unsigned long) HAL_DCMIPP_PIPE_GetState(&hcamera_dcmipp, pipe),
         (unsigned long) HAL_DCMIPP_GetError(&hcamera_dcmipp),
         (unsigned long) hcamera_dcmipp.Instance->CMCR,
         (unsigned long) hcamera_dcmipp.Instance->CMIER,
         (unsigned long) hcamera_dcmipp.Instance->CMSR1,
         (unsigned long) hcamera_dcmipp.Instance->CMSR2);

  if (pipe == DCMIPP_PIPE1)
  {
    printf("TRACE: %s: pipe1 fscr=0x%08lX fctcr=0x%08lX ppcr=0x%08lX "
           "m0ar1=0x%08lX m0ar2=0x%08lX pitch=0x%08lX ier=0x%08lX sr=0x%08lX\n",
           tag,
           (unsigned long) hcamera_dcmipp.Instance->P1FSCR,
           (unsigned long) hcamera_dcmipp.Instance->P1FCTCR,
           (unsigned long) hcamera_dcmipp.Instance->P1PPCR,
           (unsigned long) hcamera_dcmipp.Instance->P1PPM0AR1,
           (unsigned long) hcamera_dcmipp.Instance->P1PPM0AR2,
           (unsigned long) hcamera_dcmipp.Instance->P1PPM0PR,
           (unsigned long) hcamera_dcmipp.Instance->P1IER,
           (unsigned long) hcamera_dcmipp.Instance->P1SR);
  }
  else if (pipe == DCMIPP_PIPE2)
  {
    printf("TRACE: %s: pipe2 fscr=0x%08lX fctcr=0x%08lX ppcr=0x%08lX "
           "m0ar1=0x%08lX m0ar2=0x%08lX pitch=0x%08lX ier=0x%08lX sr=0x%08lX\n",
           tag,
           (unsigned long) hcamera_dcmipp.Instance->P2FSCR,
           (unsigned long) hcamera_dcmipp.Instance->P2FCTCR,
           (unsigned long) hcamera_dcmipp.Instance->P2PPCR,
           (unsigned long) hcamera_dcmipp.Instance->P2PPM0AR1,
           (unsigned long) hcamera_dcmipp.Instance->P2PPM0AR2,
           (unsigned long) hcamera_dcmipp.Instance->P2PPM0PR,
           (unsigned long) hcamera_dcmipp.Instance->P2IER,
           (unsigned long) hcamera_dcmipp.Instance->P2SR);
  }
}

#if defined(USE_IMX219_SENSOR)
static void CMW_CAMERA_IMX219_SelectDefaultMode(CMW_Sensor_Init_t *initSensors_params)
{
  /*
   * When the application does not request a specific source mode, prefer the
   * highest-FOV mode that can sustain the requested frame rate.
   *
   *  - <= 15 fps: use the full 3280x2464 array
   *  - > 15 fps : use 1640x1232 2x2 binning for full FOV at 30 fps
   */
  if ((initSensors_params->width != 0U) && (initSensors_params->height != 0U))
  {
    return;
  }

  if (initSensors_params->fps <= 15)
  {
    initSensors_params->width = IMX219_MODE_FULL_WIDTH;
    initSensors_params->height = IMX219_MODE_FULL_HEIGHT;
  }
  else
  {
    initSensors_params->width = IMX219_MODE_BINNED_WIDTH;
    initSensors_params->height = IMX219_MODE_BINNED_HEIGHT;
  }
}
#endif

DCMIPP_HandleTypeDef* CMW_CAMERA_GetDCMIPPHandle(void)
{
    return &hcamera_dcmipp;
}

