Wafleem/STM32N6-EdgeAI-CV/Middlewares/stm32-mw-camera/cmw_camera.c
  return CMW_ERROR_NONE;
}
#endif

#if defined(USE_IMX335_SENSOR)
static int32_t CMW_CAMERA_IMX335_Init(CMW_Sensor_Init_t *initSensors_params)
{
  int32_t ret = CMW_ERROR_NONE;
  DCMIPP_CSI_ConfTypeDef csi_conf = { 0 };
  DCMIPP_CSI_PIPE_ConfTypeDef csi_pipe_conf = { 0 };
  uint32_t dt_format = 0;
  uint32_t dt = 0;
  CMW_IMX335_config_t default_sensor_config;
  CMW_IMX335_config_t *sensor_config;

  memset(&camera_bsp, 0, sizeof(camera_bsp));
  camera_bsp.imx335_bsp.Address     = CAMERA_IMX335_ADDRESS;
  camera_bsp.imx335_bsp.Init        = CMW_I2C_INIT;
  camera_bsp.imx335_bsp.DeInit      = CMW_I2C_DEINIT;
  camera_bsp.imx335_bsp.ReadReg     = CMW_I2C_READREG16;
  camera_bsp.imx335_bsp.WriteReg    = CMW_I2C_WRITEREG16;
  camera_bsp.imx335_bsp.GetTick     = BSP_GetTick;
  camera_bsp.imx335_bsp.Delay       = HAL_Delay;
  camera_bsp.imx335_bsp.ShutdownPin = CMW_CAMERA_ShutdownPin;
  camera_bsp.imx335_bsp.EnablePin   = CMW_CAMERA_EnablePin;
  camera_bsp.imx335_bsp.hdcmipp     = &hcamera_dcmipp;
  camera_bsp.imx335_bsp.appliHelpers.SetSensorGain = CB_ISP_SetSensorGain;
  camera_bsp.imx335_bsp.appliHelpers.GetSensorGain = CB_ISP_GetSensorGain;
  camera_bsp.imx335_bsp.appliHelpers.SetSensorExposure = CB_ISP_SetSensorExposure;
  camera_bsp.imx335_bsp.appliHelpers.GetSensorExposure = CB_ISP_GetSensorExposure;
  camera_bsp.imx335_bsp.appliHelpers.GetSensorInfo = CB_ISP_GetSensorInfo;

  ret = CMW_IMX335_Probe(&camera_bsp.imx335_bsp, &Camera_Drv);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  if ((connected_sensor != CMW_IMX335_Sensor) && (connected_sensor != CMW_UNKNOWN_Sensor))
  {
    /* If the selected sensor in the application side has selected a different sensors than IMX335 */
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  /* Special case: when resolution is not specified take the full sensor resolution */
  if ((initSensors_params->width == 0) || (initSensors_params->height == 0))
  {
    ISP_SensorInfoTypeDef sensor_info;
    Camera_Drv.GetSensorInfo(&camera_bsp, &sensor_info);
    initSensors_params->width = sensor_info.width;
    initSensors_params->height = sensor_info.height;
  }

  CMW_IMX335_SetDefaultSensorValues(&default_sensor_config);
  initSensors_params->sensor_config = initSensors_params->sensor_config ? initSensors_params->sensor_config : &default_sensor_config;
  sensor_config = (CMW_IMX335_config_t*) (initSensors_params->sensor_config);

  ret = Camera_Drv.Init(&camera_bsp, initSensors_params);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = Camera_Drv.SetFrequency(&camera_bsp, IMX335_INCK_24MHZ);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = Camera_Drv.SetFramerate(&camera_bsp, initSensors_params->fps);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  switch (sensor_config->pixel_format)
  {
    case CMW_PIXEL_FORMAT_DEFAULT:
    case CMW_PIXEL_FORMAT_RAW10:
    {
      dt_format = DCMIPP_CSI_DT_BPP10;
      dt = DCMIPP_DT_RAW10;
      break;
    }
    default:
      return CMW_ERROR_COMPONENT_FAILURE;
  }

  csi_conf.NumberOfLanes = DCMIPP_CSI_TWO_DATA_LANES;
  csi_conf.DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES;
  csi_conf.PHYBitrate = DCMIPP_CSI_PHY_BT_1600;
  ret = HAL_DCMIPP_CSI_SetConfig(&hcamera_dcmipp, &csi_conf);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  ret = HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, DCMIPP_VIRTUAL_CHANNEL0, dt_format);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  csi_pipe_conf.DataTypeMode = DCMIPP_DTMODE_DTIDA;
  csi_pipe_conf.DataTypeIDA = dt;
  csi_pipe_conf.DataTypeIDB = 0;
  /* Pre-initialize CSI config for all the pipes */
  for (uint32_t i = DCMIPP_PIPE0; i <= DCMIPP_PIPE2; i++)
  {
    ret = HAL_DCMIPP_CSI_PIPE_SetConfig(&hcamera_dcmipp, i, &csi_pipe_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_PERIPH_FAILURE;
    }
  }


  return ret;
}
#endif

#if defined(USE_IMX219_SENSOR)
static int32_t CMW_CAMERA_IMX219_Init(CMW_Sensor_Init_t *initSensors_params)
{
  int32_t ret = CMW_ERROR_NONE;
  DCMIPP_CSI_ConfTypeDef csi_conf = { 0 };
  DCMIPP_CSI_PIPE_ConfTypeDef csi_pipe_conf = { 0 };
  uint32_t dt_format = 0;
  uint32_t dt = 0;
  CMW_IMX219_config_t default_sensor_config;
  CMW_IMX219_config_t *sensor_config;

  memset(&camera_bsp, 0, sizeof(camera_bsp));
  camera_bsp.imx219_bsp.Address     = CAMERA_IMX219_ADDRESS;
  camera_bsp.imx219_bsp.Init        = CMW_I2C_INIT;
  camera_bsp.imx219_bsp.DeInit      = CMW_I2C_DEINIT;
  camera_bsp.imx219_bsp.ReadReg     = CMW_I2C_READREG16;
  camera_bsp.imx219_bsp.WriteReg    = CMW_I2C_WRITEREG16;
  camera_bsp.imx219_bsp.GetTick     = BSP_GetTick;
  camera_bsp.imx219_bsp.Delay       = HAL_Delay;
  camera_bsp.imx219_bsp.ShutdownPin = CMW_CAMERA_ShutdownPin;
  camera_bsp.imx219_bsp.EnablePin   = CMW_CAMERA_EnablePin;
  camera_bsp.imx219_bsp.hdcmipp     = &hcamera_dcmipp;
  camera_bsp.imx219_bsp.appliHelpers.SetSensorGain     = CB_ISP_SetSensorGain;
  camera_bsp.imx219_bsp.appliHelpers.GetSensorGain     = CB_ISP_GetSensorGain;
  camera_bsp.imx219_bsp.appliHelpers.SetSensorExposure = CB_ISP_SetSensorExposure;
  camera_bsp.imx219_bsp.appliHelpers.GetSensorExposure = CB_ISP_GetSensorExposure;
  camera_bsp.imx219_bsp.appliHelpers.GetSensorInfo     = CB_ISP_GetSensorInfo;

  printf("TRACE: CMW_CAMERA_IMX219_Init: probe begin i2c_addr=0x%02X requested=%lux%lu fps=%lu\n",
         camera_bsp.imx219_bsp.Address,
         (unsigned long) initSensors_params->width,
         (unsigned long) initSensors_params->height,
         (unsigned long) initSensors_params->fps);
  ret = CMW_IMX219_Probe(&camera_bsp.imx219_bsp, &Camera_Drv);
  printf("TRACE: CMW_CAMERA_IMX219_Init: CMW_IMX219_Probe ret=%ld\n", (long) ret);
  if (ret != CMW_ERROR_NONE)
  {
    printf("ERROR: CMW_CAMERA_IMX219_Init: IMX219 probe failed ret=%ld\n", (long) ret);
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  if ((connected_sensor != CMW_IMX219_Sensor) && (connected_sensor != CMW_UNKNOWN_Sensor))
  {
    /* If the selected sensor in the application side has selected a different sensor than IMX219 */
    printf("ERROR: CMW_CAMERA_IMX219_Init: selected sensor mismatch requested=%s\n",
           CMW_CAMERA_SensorNameToString(connected_sensor));
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  CMW_CAMERA_IMX219_SelectDefaultMode(initSensors_params);
  printf("TRACE: CMW_CAMERA_IMX219_Init: selected mode %lux%lu fps=%lu\n",
         (unsigned long) initSensors_params->width,
         (unsigned long) initSensors_params->height,
         (unsigned long) initSensors_params->fps);

