Wafleem/STM32N6-EdgeAI-CV/Middlewares/stm32-mw-camera/cmw_camera.c
  CMW_IMX219_SetDefaultSensorValues(&default_sensor_config);
  initSensors_params->sensor_config = initSensors_params->sensor_config ? initSensors_params->sensor_config : &default_sensor_config;
  sensor_config = (CMW_IMX219_config_t *)(initSensors_params->sensor_config);
  printf("TRACE: CMW_CAMERA_IMX219_Init: pixel_format=0x%08lX\n",
         (unsigned long) sensor_config->pixel_format);

  ret = Camera_Drv.Init(&camera_bsp, initSensors_params);
  printf("TRACE: CMW_CAMERA_IMX219_Init: Camera_Drv.Init ret=%ld\n", (long) ret);
  if (ret != CMW_ERROR_NONE)
  {
    printf("ERROR: CMW_CAMERA_IMX219_Init: Camera_Drv.Init failed ret=%ld\n", (long) ret);
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = Camera_Drv.SetFrequency(&camera_bsp, IMX219_INCK_24MHZ);
  printf("TRACE: CMW_CAMERA_IMX219_Init: SetFrequency(24MHz) ret=%ld\n", (long) ret);
  if (ret != CMW_ERROR_NONE)
  {
    printf("ERROR: CMW_CAMERA_IMX219_Init: SetFrequency failed ret=%ld\n", (long) ret);
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = Camera_Drv.SetFramerate(&camera_bsp, initSensors_params->fps);
  printf("TRACE: CMW_CAMERA_IMX219_Init: SetFramerate(%lu) ret=%ld\n",
         (unsigned long) initSensors_params->fps, (long) ret);
  if (ret != CMW_ERROR_NONE)
  {
    printf("ERROR: CMW_CAMERA_IMX219_Init: SetFramerate failed ret=%ld\n", (long) ret);
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  switch (sensor_config->pixel_format)
  {
    case CMW_PIXEL_FORMAT_DEFAULT:
    case CMW_PIXEL_FORMAT_RAW10:
    {
      dt_format = DCMIPP_CSI_DT_BPP10;
      dt = DCMIPP_DT_RAW10;
      break;
    }
    default:
      printf("ERROR: CMW_CAMERA_IMX219_Init: unsupported pixel_format=0x%08lX\n",
             (unsigned long) sensor_config->pixel_format);
      return CMW_ERROR_COMPONENT_FAILURE;
  }

  /*
   * IMX219 D-PHY: 2 data lanes @ 912 Mbps/lane.
   * DCMIPP_CSI_PHY_BT_900 (900 Mbps) is the closest supported rate and
   * the STM32N6 D-PHY receiver locks correctly at this setting.
   */
  csi_conf.NumberOfLanes  = DCMIPP_CSI_TWO_DATA_LANES;
  csi_conf.DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES;
  csi_conf.PHYBitrate     = DCMIPP_CSI_PHY_BT_900;
  printf("TRACE: CMW_CAMERA_IMX219_Init: HAL_DCMIPP_CSI_SetConfig lanes=2 phy=900Mbps begin\n");
  ret = HAL_DCMIPP_CSI_SetConfig(&hcamera_dcmipp, &csi_conf);
  printf("TRACE: CMW_CAMERA_IMX219_Init: HAL_DCMIPP_CSI_SetConfig ret=%ld\n", (long) ret);
  if (ret != HAL_OK)
  {
    printf("ERROR: CMW_CAMERA_IMX219_Init: HAL_DCMIPP_CSI_SetConfig failed ret=%ld\n", (long) ret);
    return CMW_ERROR_PERIPH_FAILURE;
  }

  printf("TRACE: CMW_CAMERA_IMX219_Init: HAL_DCMIPP_CSI_SetVCConfig dt_format=0x%08lX begin\n",
         (unsigned long) dt_format);
  ret = HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, DCMIPP_VIRTUAL_CHANNEL0, dt_format);
  printf("TRACE: CMW_CAMERA_IMX219_Init: HAL_DCMIPP_CSI_SetVCConfig ret=%ld\n", (long) ret);
  if (ret != HAL_OK)
  {
    printf("ERROR: CMW_CAMERA_IMX219_Init: HAL_DCMIPP_CSI_SetVCConfig failed ret=%ld\n", (long) ret);
    return CMW_ERROR_PERIPH_FAILURE;
  }

  csi_pipe_conf.DataTypeMode = DCMIPP_DTMODE_DTIDA;
  csi_pipe_conf.DataTypeIDA  = dt;
  csi_pipe_conf.DataTypeIDB  = 0;
  printf("TRACE: CMW_CAMERA_IMX219_Init: pipe CSI datatype dt=0x%08lX\n",
         (unsigned long) dt);
  /* Pre-initialize CSI config for all the pipes */
  for (uint32_t i = DCMIPP_PIPE0; i <= DCMIPP_PIPE2; i++)
  {
    ret = HAL_DCMIPP_CSI_PIPE_SetConfig(&hcamera_dcmipp, i, &csi_pipe_conf);
    printf("TRACE: CMW_CAMERA_IMX219_Init: HAL_DCMIPP_CSI_PIPE_SetConfig pipe=%lu ret=%ld\n",
           (unsigned long) i, (long) ret);
    if (ret != HAL_OK)
    {
      printf("ERROR: CMW_CAMERA_IMX219_Init: pipe CSI config failed pipe=%lu ret=%ld\n",
             (unsigned long) i, (long) ret);
      return CMW_ERROR_PERIPH_FAILURE;
    }
  }

  printf("TRACE: CMW_CAMERA_IMX219_Init: complete\n");
  return ret;
}
#endif

static int32_t CMW_CAMERA_SetPipe(DCMIPP_HandleTypeDef *hdcmipp, uint32_t pipe, CMW_DCMIPP_Conf_t *p_conf, uint32_t *pitch)
{
  DCMIPP_DecimationConfTypeDef dec_conf = { 0 };
  DCMIPP_PipeConfTypeDef pipe_conf = { 0 };
  DCMIPP_DownsizeTypeDef down_conf = { 0 };
  DCMIPP_CropConfTypeDef crop_conf = { 0 };
  int ret;

  /* specific case for pipe0 which is only a dump pipe */
  if (pipe == DCMIPP_PIPE0)
  {
    /*  TODO: properly configure the dump pipe with decimation and crop */
    pipe_conf.FrameRate = DCMIPP_FRAME_RATE_ALL;
    ret = HAL_DCMIPP_PIPE_SetConfig(hdcmipp, pipe, &pipe_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    return CMW_ERROR_NONE;
  }

  CMW_UTILS_GetPipeConfig(camera_conf.width, camera_conf.height, p_conf, &crop_conf, &dec_conf, &down_conf);

  if (crop_conf.VSize != 0 || crop_conf.HSize != 0)
  {
    ret = HAL_DCMIPP_PIPE_SetCropConfig(hdcmipp, pipe, &crop_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    ret = HAL_DCMIPP_PIPE_EnableCrop(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    ret = HAL_DCMIPP_PIPE_DisableCrop(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  if (dec_conf.VRatio != 0 || dec_conf.HRatio != 0)
  {
    ret = HAL_DCMIPP_PIPE_SetDecimationConfig(hdcmipp, pipe, &dec_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    ret = HAL_DCMIPP_PIPE_EnableDecimation(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    ret = HAL_DCMIPP_PIPE_DisableDecimation(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  ret = HAL_DCMIPP_PIPE_SetDownsizeConfig(hdcmipp, pipe, &down_conf);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = HAL_DCMIPP_PIPE_EnableDownsize(hdcmipp, pipe);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  if (p_conf->enable_swap)
  {
    /* Config pipe */
    ret = HAL_DCMIPP_PIPE_EnableRedBlueSwap(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    ret = HAL_DCMIPP_PIPE_DisableRedBlueSwap(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Ignore the configuration of gamma if -1
   * Activation is then done by the ISP Library
   */
  if (p_conf->enable_gamma_conversion > -1)
  {
    if (p_conf->enable_gamma_conversion)
    {
      ret = HAL_DCMIPP_PIPE_EnableGammaConversion(hdcmipp, pipe);
      if (ret != HAL_OK)
      {
        return CMW_ERROR_COMPONENT_FAILURE;
      }
    }
    else
    {
      ret = HAL_DCMIPP_PIPE_DisableGammaConversion(hdcmipp, pipe);
      if (ret != HAL_OK)
      {
        return CMW_ERROR_COMPONENT_FAILURE;
      }
    }
  }

  if (pipe == DCMIPP_PIPE2)
  {
    if (!is_pipe1_2_shared)
    {
      ret = HAL_DCMIPP_PIPE_CSI_EnableShare(hdcmipp, pipe);
      if (ret != HAL_OK)
      {
        return CMW_ERROR_COMPONENT_FAILURE;
      }
      is_pipe1_2_shared++;
    }
  }

  pipe_conf.FrameRate = DCMIPP_FRAME_RATE_ALL;
  pipe_conf.PixelPipePitch = p_conf->output_width * p_conf->output_bpp;
  /* Hardware constraint, pitch must be multiple of 16 */
  pipe_conf.PixelPipePitch = (pipe_conf.PixelPipePitch + 15) & (uint32_t) ~15;
  pipe_conf.PixelPackerFormat = p_conf->output_format;

  /* Support of YUV pixel format */
  if (pipe_conf.PixelPackerFormat == DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1)
  {
    if (pipe != DCMIPP_PIPE1)
    {
      /* Only pipe 1 support YUV conversion */
      return CMW_ERROR_FEATURE_NOT_SUPPORTED;
    }

    #define N10(val) (((val) ^ 0x7FF) + 1)
    DCMIPP_ColorConversionConfTypeDef yuv_color_conf = {
    .ClampOutputSamples = ENABLE,
    .OutputSamplesType = 0,
    .RR = 131,     .RG = N10(110), .RB = N10(21), .RA = 128,
    .GR = 77,      .GG = 150,      .GB = 29,      .GA = 0,
    .BR = N10(44), .BG = N10(87),  .BB = 131,     .BA = 128,
    };

    ret = HAL_DCMIPP_PIPE_SetYUVConversionConfig(hdcmipp, pipe, &yuv_color_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
    ret = HAL_DCMIPP_PIPE_EnableYUVConversion(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  if (hcamera_dcmipp.PipeState[pipe] == HAL_DCMIPP_PIPE_STATE_RESET)
  {
    ret = HAL_DCMIPP_PIPE_SetConfig(hdcmipp, pipe, &pipe_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    if (HAL_DCMIPP_PIPE_SetPixelPackerFormat(hdcmipp, pipe, pipe_conf.PixelPackerFormat) != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    if (HAL_DCMIPP_PIPE_SetPitch(hdcmipp, pipe, pipe_conf.PixelPipePitch) != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Update the pitch field so that application can use this information for
   * buffer alignement */
  *pitch = pipe_conf.PixelPipePitch;

