Wafleem/STM32N6-EdgeAI-CV/Middlewares/stm32-mw-camera/cmw_camera.c
  return CMW_ERROR_NONE;
}

int32_t CMW_CAMERA_SetDefaultSensorValues( CMW_Advanced_Config_t *advanced_config )
{
  if (advanced_config == NULL)
  {
    return CMW_ERROR_WRONG_PARAM;
  }
  switch (advanced_config->selected_sensor)
  {
#if defined(USE_VD66GY_SENSOR)
  case CMW_VD66GY_Sensor:
    CMW_VD66GY_SetDefaultSensorValues(&advanced_config->config_sensor.vd66gy_config);
    break;
#endif
#if defined(USE_VD55G1_SENSOR)
  case CMW_VD55G1_Sensor:
    CMW_VD55G1_SetDefaultSensorValues(&advanced_config->config_sensor.vd55g1_config);
    break;
#endif
#if defined(USE_VD65G4_SENSOR)
  case CMW_VD65G4_Sensor:
    CMW_VD65G4_SetDefaultSensorValues(&advanced_config->config_sensor.vd65g4_config);
    break;
#endif
#if defined(USE_IMX335_SENSOR)
  case CMW_IMX335_Sensor:
    CMW_IMX335_SetDefaultSensorValues(&advanced_config->config_sensor.imx335_config);
    break;
#endif
#if defined(USE_OV5640_SENSOR)
  case CMW_OV5640_Sensor:
    CMW_OV5640_SetDefaultSensorValues(&advanced_config->config_sensor.ov5640_config);
    break;
#endif
#if defined(USE_VD1943_SENSOR)
  case CMW_VD1943_Sensor:
    CMW_VD1943_SetDefaultSensorValues(&advanced_config->config_sensor.vd1943_config);
    break;
#endif
#if defined(USE_VD5943_SENSOR)
  case CMW_VD5943_Sensor:
    CMW_VD5943_SetDefaultSensorValues(&advanced_config->config_sensor.vd5943_config);
    break;
#endif
#if defined(USE_IMX219_SENSOR)
  case CMW_IMX219_Sensor:
    CMW_IMX219_SetDefaultSensorValues(&advanced_config->config_sensor.imx219_config);
    break;
#endif
  default:
    return CMW_ERROR_WRONG_PARAM;
    break;
  }

  return CMW_ERROR_NONE;
}

/**
  * @brief  Error callback on the pipe. Occurs when overrun occurs on the pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval None
  */
void HAL_DCMIPP_PIPE_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  UNUSED(hdcmipp);

  CMW_CAMERA_PIPE_ErrorCallback(Pipe);
}

void HAL_DCMIPP_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp)
{
  UNUSED(hdcmipp);

  printf("ERROR: HAL_DCMIPP_ErrorCallback: err=0x%08lX cmier=0x%08lX cmsr1=0x%08lX cmsr2=0x%08lX "
         "p1sr=0x%08lX p2sr=0x%08lX\n",
         (unsigned long) HAL_DCMIPP_GetError(&hcamera_dcmipp),
         (unsigned long) hcamera_dcmipp.Instance->CMIER,
         (unsigned long) hcamera_dcmipp.Instance->CMSR1,
         (unsigned long) hcamera_dcmipp.Instance->CMSR2,
         (unsigned long) hcamera_dcmipp.Instance->P1SR,
         (unsigned long) hcamera_dcmipp.Instance->P2SR);
}

void HAL_DCMIPP_CSI_LineErrorCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t DataLane)
{
  UNUSED(hdcmipp);

  printf("ERROR: HAL_DCMIPP_CSI_LineErrorCallback: lane=%lu err=0x%08lX cmsr1=0x%08lX cmsr2=0x%08lX\n",
         (unsigned long) DataLane,
         (unsigned long) HAL_DCMIPP_GetError(&hcamera_dcmipp),
         (unsigned long) hcamera_dcmipp.Instance->CMSR1,
         (unsigned long) hcamera_dcmipp.Instance->CMSR2);
}

void HAL_DCMIPP_CSI_StartOfFrameEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t VirtualChannel)
{
  static uint32_t trace_count;
  UNUSED(hdcmipp);

  if (trace_count < 5U)
  {
    printf("TRACE: HAL_DCMIPP_CSI_StartOfFrameEventCallback: vc=%lu count=%lu cmsr1=0x%08lX cmsr2=0x%08lX\n",
           (unsigned long) VirtualChannel,
           (unsigned long) trace_count,
           (unsigned long) hcamera_dcmipp.Instance->CMSR1,
           (unsigned long) hcamera_dcmipp.Instance->CMSR2);
  }
  trace_count++;
}

void HAL_DCMIPP_CSI_EndOfFrameEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t VirtualChannel)
{
  static uint32_t trace_count;
  UNUSED(hdcmipp);

  if (trace_count < 5U)
  {
    printf("TRACE: HAL_DCMIPP_CSI_EndOfFrameEventCallback: vc=%lu count=%lu cmsr1=0x%08lX cmsr2=0x%08lX\n",
           (unsigned long) VirtualChannel,
           (unsigned long) trace_count,
           (unsigned long) hcamera_dcmipp.Instance->CMSR1,
           (unsigned long) hcamera_dcmipp.Instance->CMSR2);
  }
  trace_count++;
}

void HAL_DCMIPP_CSI_ClockChangerFifoFullEventCallback(DCMIPP_HandleTypeDef *hdcmipp)
{
  UNUSED(hdcmipp);

  printf("ERROR: HAL_DCMIPP_CSI_ClockChangerFifoFullEventCallback: err=0x%08lX cmsr1=0x%08lX cmsr2=0x%08lX\n",
         (unsigned long) HAL_DCMIPP_GetError(&hcamera_dcmipp),
         (unsigned long) hcamera_dcmipp.Instance->CMSR1,
         (unsigned long) hcamera_dcmipp.Instance->CMSR2);
}

void HAL_DCMIPP_CSI_ShortPacketDetectionEventCallback(DCMIPP_HandleTypeDef *hdcmipp)
{
  UNUSED(hdcmipp);

  printf("ERROR: HAL_DCMIPP_CSI_ShortPacketDetectionEventCallback: err=0x%08lX cmsr1=0x%08lX cmsr2=0x%08lX\n",
         (unsigned long) HAL_DCMIPP_GetError(&hcamera_dcmipp),
         (unsigned long) hcamera_dcmipp.Instance->CMSR1,
         (unsigned long) hcamera_dcmipp.Instance->CMSR2);
}
